
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |      10 |          5 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                  |
|:--------:|:-------------------------------------------------------------------------------------------|
|    🟢     | `module.buckets["infrahouse-aws-control-289256138624"].aws_dynamodb_table.terraform_locks` |
|    🟢     | `module.buckets["infrahouse-aws-control-289256138624"].random_pet.suffix`                  |
|    🟢     | `module.buckets["infrahouse-aws-control-303467602807"].aws_dynamodb_table.terraform_locks` |
|    🟢     | `module.buckets["infrahouse-aws-control-303467602807"].random_pet.suffix`                  |
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].aws_dynamodb_table.terraform_locks` |
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].random_pet.suffix`                  |
|    🟢     | `module.buckets["infrahouse-aws-control-990466748045"].aws_dynamodb_table.terraform_locks` |
|    🟢     | `module.buckets["infrahouse-aws-control-990466748045"].random_pet.suffix`                  |
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_dynamodb_table.terraform_locks`            |
|    🟢     | `module.buckets["infrahouse-website-infra"].random_pet.suffix`                             |
|    🟢     | `data.aws_iam_policy_document.ih-tf-aws-control-assume:`                                   |
|    🟡     | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket`         |
|    🟡     | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket`         |
|    🟡     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`         |
|    🟡     | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket`         |
|    🟡     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                    |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/79778db8-4ce8-45da-b7f8-9d8d7962cbfe/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=3179811597]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume: Reading...
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3184570819]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2714260376]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Reading...
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3211474565]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-ro20230810231251270100000004]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-ro20230810231251274700000006]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]
module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-ro20230811153208393500000002]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-ro20230810231251262700000001]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-ro20230810231251272400000005]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-infrahouse-website-infra-state-manager-ro20230817170907927600000001]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.ih-tf-aws-control-289256138624-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125193800000000e]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125190470000000c]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only-20230811153208651800000003]
module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager-20230818034356037800000001]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3532652678]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]
module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-infrahouse-website-infra-state-manager-rw20230817170907949600000002]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-rw20230811153208390900000001]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-rw20230810231251266200000002]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-rw20230810231251267600000003]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-rw20230810231251542800000007]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-rw20230810231251545600000008]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-2023081023125190440000000b]
module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager-20230818034356170800000002]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125187350000000a]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125199570000000f]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230810231252046000000010]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github-20230817154309876900000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-2023081023125191850000000d]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230810231251872800000009]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-289256138624"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          + "repo"              = "infrahouse/aws-control-289256138624"
          + "state_bucket"      = "infrahouse-aws-control-289256138624"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          + "repo"              = "infrahouse/aws-control-289256138624"
          + "state_bucket"      = "infrahouse-aws-control-289256138624"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-289256138624"
      ~ tags                        = {
          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          - "repo"        = "infrahouse/aws-control-289256138624"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          - "repo"        = "infrahouse/aws-control-289256138624"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-289256138624"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          + "repo"              = "infrahouse/aws-control-303467602807"
          + "state_bucket"      = "infrahouse-aws-control-303467602807"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          + "repo"              = "infrahouse/aws-control-303467602807"
          + "state_bucket"      = "infrahouse-aws-control-303467602807"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-303467602807"
      ~ tags                        = {
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          - "repo"        = "infrahouse/aws-control-303467602807"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          - "repo"        = "infrahouse/aws-control-303467602807"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-303467602807"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          + "repo"              = "infrahouse/aws-control-493370826424"
          + "state_bucket"      = "infrahouse-aws-control-493370826424"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          + "repo"              = "infrahouse/aws-control-493370826424"
          + "state_bucket"      = "infrahouse-aws-control-493370826424"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-493370826424"
      ~ tags                        = {
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          - "repo"        = "infrahouse/aws-control-493370826424"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          - "repo"        = "infrahouse/aws-control-493370826424"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-493370826424"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          + "repo"              = "infrahouse/aws-control"
          + "state_bucket"      = "infrahouse-aws-control-990466748045"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          + "repo"              = "infrahouse/aws-control"
          + "state_bucket"      = "infrahouse-aws-control-990466748045"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-990466748045"
      ~ tags                        = {
          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          - "repo"        = "infrahouse/aws-control"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          - "repo"        = "infrahouse/aws-control"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-990466748045"
      + separator = "-"
    }

  # module.buckets["infrahouse-website-infra"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"              = "infrahouse/infrahouse-website-infra"
          + "state_bucket"      = "infrahouse-website-infra"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"              = "infrahouse/infrahouse-website-infra"
          + "state_bucket"      = "infrahouse-website-infra"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-website-infra"
      ~ tags                        = {
          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          - "repo"        = "infrahouse/infrahouse-website-infra"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          - "repo"        = "infrahouse/infrahouse-website-infra"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-website-infra"
      + separator = "-"
    }

Plan: 10 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=3179811597]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume: Reading...%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3184570819]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2714260376]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Reading...%0Aaws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3211474565]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-ro20230810231251270100000004]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-ro20230810231251274700000006]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-ro20230811153208393500000002]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-ro20230810231251262700000001]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-ro20230810231251272400000005]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-infrahouse-website-infra-state-manager-ro20230817170907927600000001]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125193800000000e]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125190470000000c]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only-20230811153208651800000003]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager-20230818034356037800000001]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3532652678]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-infrahouse-website-infra-state-manager-rw20230817170907949600000002]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-rw20230811153208390900000001]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-rw20230810231251266200000002]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-rw20230810231251267600000003]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-rw20230810231251542800000007]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-rw20230810231251545600000008]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-2023081023125190440000000b]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-infrahouse-website-infra-state-manager-20230818034356170800000002]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125187350000000a]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125199570000000f]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230810231252046000000010]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github-20230817154309876900000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-2023081023125191850000000d]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230810231251872800000009]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.buckets["infrahouse-aws-control-289256138624"].aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A          + "repo"              = "infrahouse/aws-control-289256138624"%0A          + "state_bucket"      = "infrahouse-aws-control-289256138624"%0A        }%0A      + tags_all         = {%0A          + "created_by"        = "infrahouse/aws-control-289256138624"%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A          + "repo"              = "infrahouse/aws-control-289256138624"%0A          + "state_bucket"      = "infrahouse-aws-control-289256138624"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-289256138624"%0A      ~ tags                        = {%0A          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A          - "repo"        = "infrahouse/aws-control-289256138624"%0A        } -> (known after apply)%0A      ~ tags_all                    = {%0A          - "created_by"  = "infrahouse/aws-control-289256138624"%0A          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A          - "repo"        = "infrahouse/aws-control-289256138624"%0A        } -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-289256138624"].random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-aws-control-289256138624"%0A      + separator = "-"%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-303467602807"].aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A          + "repo"              = "infrahouse/aws-control-303467602807"%0A          + "state_bucket"      = "infrahouse-aws-control-303467602807"%0A        }%0A      + tags_all         = {%0A          + "created_by"        = "infrahouse/aws-control-289256138624"%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A          + "repo"              = "infrahouse/aws-control-303467602807"%0A          + "state_bucket"      = "infrahouse-aws-control-303467602807"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-303467602807"%0A      ~ tags                        = {%0A          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A          - "repo"        = "infrahouse/aws-control-303467602807"%0A        } -> (known after apply)%0A      ~ tags_all                    = {%0A          - "created_by"  = "infrahouse/aws-control-289256138624"%0A          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A          - "repo"        = "infrahouse/aws-control-303467602807"%0A        } -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-303467602807"].random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-aws-control-303467602807"%0A      + separator = "-"%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A          + "repo"              = "infrahouse/aws-control-493370826424"%0A          + "state_bucket"      = "infrahouse-aws-control-493370826424"%0A        }%0A      + tags_all         = {%0A          + "created_by"        = "infrahouse/aws-control-289256138624"%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A          + "repo"              = "infrahouse/aws-control-493370826424"%0A          + "state_bucket"      = "infrahouse-aws-control-493370826424"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-493370826424"%0A      ~ tags                        = {%0A          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A          - "repo"        = "infrahouse/aws-control-493370826424"%0A        } -> (known after apply)%0A      ~ tags_all                    = {%0A          - "created_by"  = "infrahouse/aws-control-289256138624"%0A          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A          - "repo"        = "infrahouse/aws-control-493370826424"%0A        } -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-aws-control-493370826424"%0A      + separator = "-"%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-990466748045"].aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A          + "repo"              = "infrahouse/aws-control"%0A          + "state_bucket"      = "infrahouse-aws-control-990466748045"%0A        }%0A      + tags_all         = {%0A          + "created_by"        = "infrahouse/aws-control-289256138624"%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A          + "repo"              = "infrahouse/aws-control"%0A          + "state_bucket"      = "infrahouse-aws-control-990466748045"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-990466748045"%0A      ~ tags                        = {%0A          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A          - "repo"        = "infrahouse/aws-control"%0A        } -> (known after apply)%0A      ~ tags_all                    = {%0A          - "created_by"  = "infrahouse/aws-control-289256138624"%0A          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A          - "repo"        = "infrahouse/aws-control"%0A        } -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-990466748045"].random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-aws-control-990466748045"%0A      + separator = "-"%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_dynamodb_table.terraform_locks will be created%0A  + resource "aws_dynamodb_table" "terraform_locks" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = (known after apply)%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          + "repo"              = "infrahouse/infrahouse-website-infra"%0A          + "state_bucket"      = "infrahouse-website-infra"%0A        }%0A      + tags_all         = {%0A          + "created_by"        = "infrahouse/aws-control-289256138624"%0A          + "created_by_module" = "infrahouse/state-bucket/aws"%0A          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          + "repo"              = "infrahouse/infrahouse-website-infra"%0A          + "state_bucket"      = "infrahouse-website-infra"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A%0A      + point_in_time_recovery (known after apply)%0A%0A      + server_side_encryption (known after apply)%0A%0A      + ttl (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-website-infra"%0A      ~ tags                        = {%0A          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          - "repo"        = "infrahouse/infrahouse-website-infra"%0A        } -> (known after apply)%0A      ~ tags_all                    = {%0A          - "created_by"  = "infrahouse/aws-control-289256138624"%0A          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          - "repo"        = "infrahouse/infrahouse-website-infra"%0A        } -> (known after apply)%0A        # (12 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].random_pet.suffix will be created%0A  + resource "random_pet" "suffix" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + prefix    = "infrahouse-website-infra"%0A      + separator = "-"%0A    }%0A%0APlan: 10 to add, 5 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC83OTc3OGRiOC00Y2U4LTQ1ZGEtYjdmOC05ZDhkNzk2MmNiZmUvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI2ODY3Mzg1Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxNzk4MTE1OTddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbmF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdXG5hd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2NzAwOTk1MTZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA0MjU5ODQ0MV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTg0NTcwODE5XVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzE0MjYwMzc2XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDM0MTg1NjgzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODE2OTUyMzE5XVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbmF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMjExNDc0NTY1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMDEwNTEzODA3XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTYzOTE5MjM3XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1ybzIwMjMwODEwMjMxMjUxMjcwMTAwMDAwMDA0XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTAyMzEyNTEyNzQ3MDAwMDAwMDZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LXJvMjAyMzA4MTExNTMyMDgzOTM1MDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTAyMzEyNTEyNjI3MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci1ybzIwMjMwODEwMjMxMjUxMjcyNDAwMDAwMDA1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxNzE3MDkwNzkyNzYwMDAwMDAwMV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxOTM4MDAwMDAwMDBlXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkwNDcwMDAwMDAwY11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS0yMDIzMDgxMTE1MzIwODY1MTgwMDAwMDAwM11cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXItMjAyMzA4MTgwMzQzNTYwMzc4MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1MzI2NTI2NzhdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU4MzA2ODU5Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI0MTc1NjM3NF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODQyOTY4NTcwXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODY1MjEzMDI2XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTgzMDY4NTkyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci1ydzIwMjMwODE3MTcwOTA3OTQ5NjAwMDAwMDAyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LXJ3MjAyMzA4MTExNTMyMDgzOTA5MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTEyNjYyMDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTEyNjc2MDAwMDAwMDNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTU0MjgwMDAwMDAwN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTU0NTYwMDAwMDAwOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5MDQ0MDAwMDAwMGJdXG5tb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLTIwMjMwODE4MDM0MzU2MTcwODAwMDAwMDAyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTg3MzUwMDAwMDAwYV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTk5NTcwMDAwMDAwZl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTIwNDYwMDAwMDAwMTBdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yMDIzMDYzMDAwMzUzMDUzMDkwMDAwMDAwMV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzQzNzA0MDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjI3MTcyNzMzOTMxMjAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWdpdGh1Yi0yMDIzMDgxNzE1NDMwOTg3NjkwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLTIwMjMwNzAyMDE1MjQwMTg2NTAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkxODUwMDAwMDAwZF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE4NzI4MDAwMDAwMDldXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2R5bmFtb2RiX3RhYmxlXCIgXCJ0ZXJyYWZvcm1fbG9ja3NcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJpbGxpbmdfbW9kZSAgICAgPSBcIlBBWV9QRVJfUkVRVUVTVFwiXG4gICAgICArIGhhc2hfa2V5ICAgICAgICAgPSBcIkxvY2tJRFwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlYWRfY2FwYWNpdHkgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9sYWJlbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV92aWV3X3R5cGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgICAgKyB3cml0ZV9jYXBhY2l0eSAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGF0dHJpYnV0ZSB7XG4gICAgICAgICAgKyBuYW1lID0gXCJMb2NrSURcIlxuICAgICAgICAgICsgdHlwZSA9IFwiU1wiXG4gICAgICAgIH1cblxuICAgICAgKyBwb2ludF9pbl90aW1lX3JlY292ZXJ5IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uIChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyB0dGwgKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0ZXJyYWZvcm0tY29udHJvbCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgLSBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDEyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0ucmFuZG9tX3BldC5zdWZmaXggd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7XG4gICAgICArIGlkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGVuZ3RoICAgID0gMlxuICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICsgc2VwYXJhdG9yID0gXCItXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3Mgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfZHluYW1vZGJfdGFibGVcIiBcInRlcnJhZm9ybV9sb2Nrc1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYmlsbGluZ19tb2RlICAgICA9IFwiUEFZX1BFUl9SRVFVRVNUXCJcbiAgICAgICsgaGFzaF9rZXkgICAgICAgICA9IFwiTG9ja0lEXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVhZF9jYXBhY2l0eSAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RyZWFtX2FybiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RyZWFtX2xhYmVsICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RyZWFtX3ZpZXdfdHlwZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCJcbiAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCJcbiAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICB9XG4gICAgICArIHdyaXRlX2NhcGFjaXR5ICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgYXR0cmlidXRlIHtcbiAgICAgICAgICArIG5hbWUgPSBcIkxvY2tJRFwiXG4gICAgICAgICAgKyB0eXBlID0gXCJTXCJcbiAgICAgICAgfVxuXG4gICAgICArIHBvaW50X2luX3RpbWVfcmVjb3ZlcnkgKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIHR0bCAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgLSBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMTIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5yYW5kb21fcGV0LnN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcInJhbmRvbV9wZXRcIiBcInN1ZmZpeFwiIHtcbiAgICAgICsgaWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsZW5ndGggICAgPSAyXG4gICAgICArIHByZWZpeCAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgKyBzZXBhcmF0b3IgPSBcIi1cIlxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19keW5hbW9kYl90YWJsZVwiIFwidGVycmFmb3JtX2xvY2tzXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIlxuICAgICAgKyBoYXNoX2tleSAgICAgICAgID0gXCJMb2NrSURcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWFkX2NhcGFjaXR5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdHJlYW1fdmlld190eXBlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIlxuICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiICAgICAgID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIlxuICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiICAgICAgID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgIH1cbiAgICAgICsgd3JpdGVfY2FwYWNpdHkgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBhdHRyaWJ1dGUge1xuICAgICAgICAgICsgbmFtZSA9IFwiTG9ja0lEXCJcbiAgICAgICAgICArIHR5cGUgPSBcIlNcIlxuICAgICAgICB9XG5cbiAgICAgICsgcG9pbnRfaW5fdGltZV9yZWNvdmVyeSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc2VydmVyX3NpZGVfZW5jcnlwdGlvbiAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgdHRsIChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgxMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLnJhbmRvbV9wZXQuc3VmZml4IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwicmFuZG9tX3BldFwiIFwic3VmZml4XCIge1xuICAgICAgKyBpZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGxlbmd0aCAgICA9IDJcbiAgICAgICsgcHJlZml4ICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICArIHNlcGFyYXRvciA9IFwiLVwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2R5bmFtb2RiX3RhYmxlXCIgXCJ0ZXJyYWZvcm1fbG9ja3NcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJpbGxpbmdfbW9kZSAgICAgPSBcIlBBWV9QRVJfUkVRVUVTVFwiXG4gICAgICArIGhhc2hfa2V5ICAgICAgICAgPSBcIkxvY2tJRFwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlYWRfY2FwYWNpdHkgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9sYWJlbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV92aWV3X3R5cGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgfVxuICAgICAgKyB3cml0ZV9jYXBhY2l0eSAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGF0dHJpYnV0ZSB7XG4gICAgICAgICAgKyBuYW1lID0gXCJMb2NrSURcIlxuICAgICAgICAgICsgdHlwZSA9IFwiU1wiXG4gICAgICAgIH1cblxuICAgICAgKyBwb2ludF9pbl90aW1lX3JlY292ZXJ5IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uIChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyB0dGwgKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCJcbiAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0aGUgbWFpbiBBV1MgYWNjb3VudCA5OTA0NjY3NDgwNDUgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2xcIlxuICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCJcbiAgICAgICAgfSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICMgKDEyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0ucmFuZG9tX3BldC5zdWZmaXggd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7XG4gICAgICArIGlkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGVuZ3RoICAgID0gMlxuICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICsgc2VwYXJhdG9yID0gXCItXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2R5bmFtb2RiX3RhYmxlXCIgXCJ0ZXJyYWZvcm1fbG9ja3NcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJpbGxpbmdfbW9kZSAgICAgPSBcIlBBWV9QRVJfUkVRVUVTVFwiXG4gICAgICArIGhhc2hfa2V5ICAgICAgICAgPSBcIkxvY2tJRFwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlYWRfY2FwYWNpdHkgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV9sYWJlbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0cmVhbV92aWV3X3R5cGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCJcbiAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgIH1cbiAgICAgICsgd3JpdGVfY2FwYWNpdHkgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBhdHRyaWJ1dGUge1xuICAgICAgICAgICsgbmFtZSA9IFwiTG9ja0lEXCJcbiAgICAgICAgICArIHR5cGUgPSBcIlNcIlxuICAgICAgICB9XG5cbiAgICAgICsgcG9pbnRfaW5fdGltZV9yZWNvdmVyeSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc2VydmVyX3NpZGVfZW5jcnlwdGlvbiAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgdHRsIChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoMTIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0ucmFuZG9tX3BldC5zdWZmaXggd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7XG4gICAgICArIGlkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGVuZ3RoICAgID0gMlxuICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICArIHNlcGFyYXRvciA9IFwiLVwiXG4gICAgfVxuXG5QbGFuOiAxMCB0byBhZGQsIDUgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTc5ODExNTk3XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3JvbGUuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sXSUwQWF3c19pYW1fcm9sZS5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2xdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjcwMDk5NTE2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMDQyNTk4NDQxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTg0NTcwODE5XSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcxNDI2MDM3Nl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MTY5NTIzMTldJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzIxMTQ3NDU2NV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzAxMDUxMzgwN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxNjM5MTkyMzddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1ybzIwMjMwODEwMjMxMjUxMjcwMTAwMDAwMDA0XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci1ybzIwMjMwODEwMjMxMjUxMjc0NzAwMDAwMDA2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS1ybzIwMjMwODExMTUzMjA4MzkzNTAwMDAwMDAyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI2MjcwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI3MjQwMDAwMDAwNV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHldJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTcxNzA5MDc5Mjc2MDAwMDAwMDFdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5MzgwMDAwMDAwMGVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkwNDcwMDAwMDAwY10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHktMjAyMzA4MTExNTMyMDg2NTE4MDAwMDAwMDNdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci0yMDIzMDgxODAzNDM1NjAzNzgwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTMyNjUyNjc4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU4MzA2ODU5Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQxNzU2Mzc0XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTg0Mjk2ODU3MF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODY1MjEzMDI2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1ODMwNjg1OTJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAyMjgzNTE4Nl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTcxNzA5MDc5NDk2MDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LXJ3MjAyMzA4MTExNTMyMDgzOTA5MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci1ydzIwMjMwODEwMjMxMjUxMjY2MjAwMDAwMDAyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTI2NzYwMDAwMDAwM10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTU0MjgwMDAwMDAwN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTE1NDU2MDAwMDAwMDhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5MDQ0MDAwMDAwMGJdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci0yMDIzMDgxODAzNDM1NjE3MDgwMDAwMDAwMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxODczNTAwMDAwMDBhXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTk5NTcwMDAwMDAwZl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUyMDQ2MDAwMDAwMDEwXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yMDIzMDYzMDAwMzUzMDUzMDkwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzM5MzEyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDQ0MjM1MzddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViLTIwMjMwODE3MTU0MzA5ODc2OTAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkxODUwMDAwMDAwZF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxODcyODAwMDAwMDA5XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZHluYW1vZGJfdGFibGVcIiBcInRlcnJhZm9ybV9sb2Nrc1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIiUwQSAgICAgICsgaGFzaF9rZXkgICAgICAgICA9IFwiTG9ja0lEXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVhZF9jYXBhY2l0eSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX3ZpZXdfdHlwZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIiUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0ZXJyYWZvcm0tY29udHJvbCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCIlMEEgICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgd3JpdGVfY2FwYWNpdHkgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIGF0dHJpYnV0ZSB7JTBBICAgICAgICAgICsgbmFtZSA9IFwiTG9ja0lEXCIlMEEgICAgICAgICAgKyB0eXBlID0gXCJTXCIlMEEgICAgICAgIH0lMEElMEEgICAgICArIHBvaW50X2luX3RpbWVfcmVjb3ZlcnkgKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc2VydmVyX3NpZGVfZW5jcnlwdGlvbiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyB0dGwgKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRlcnJhZm9ybS1jb250cm9sIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgLSBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0ZXJyYWZvcm0tY29udHJvbCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDEyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5yYW5kb21fcGV0LnN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7JTBBICAgICAgKyBpZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsZW5ndGggICAgPSAyJTBBICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICArIHNlcGFyYXRvciA9IFwiLVwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19keW5hbW9kYl90YWJsZVwiIFwidGVycmFmb3JtX2xvY2tzXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJpbGxpbmdfbW9kZSAgICAgPSBcIlBBWV9QRVJfUkVRVUVTVFwiJTBBICAgICAgKyBoYXNoX2tleSAgICAgICAgID0gXCJMb2NrSURcIiUwQSAgICAgICsgaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZWFkX2NhcGFjaXR5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX2FybiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV9sYWJlbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fdmlld190eXBlID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiJTBBICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiICAgICAgID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIiUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgKyB3cml0ZV9jYXBhY2l0eSAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgYXR0cmlidXRlIHslMEEgICAgICAgICAgKyBuYW1lID0gXCJMb2NrSURcIiUwQSAgICAgICAgICArIHR5cGUgPSBcIlNcIiUwQSAgICAgICAgfSUwQSUwQSAgICAgICsgcG9pbnRfaW5fdGltZV9yZWNvdmVyeSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uIChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHR0bCAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgLSBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgIyAoMTIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLnJhbmRvbV9wZXQuc3VmZml4IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcInJhbmRvbV9wZXRcIiBcInN1ZmZpeFwiIHslMEEgICAgICArIGlkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxlbmd0aCAgICA9IDIlMEEgICAgICArIHByZWZpeCAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICsgc2VwYXJhdG9yID0gXCItXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3Mgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2R5bmFtb2RiX3RhYmxlXCIgXCJ0ZXJyYWZvcm1fbG9ja3NcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYmlsbGluZ19tb2RlICAgICA9IFwiUEFZX1BFUl9SRVFVRVNUXCIlMEEgICAgICArIGhhc2hfa2V5ICAgICAgICAgPSBcIkxvY2tJRFwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlYWRfY2FwYWNpdHkgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fYXJuICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX2xhYmVsICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV92aWV3X3R5cGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCIlMEEgICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlfbW9kdWxlXCIgPSBcImluZnJhaG91c2Uvc3RhdGUtYnVja2V0L2F3c1wiJTBBICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiICAgICAgID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcInN0YXRlX2J1Y2tldFwiICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgIH0lMEEgICAgICArIHdyaXRlX2NhcGFjaXR5ICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBhdHRyaWJ1dGUgeyUwQSAgICAgICAgICArIG5hbWUgPSBcIkxvY2tJRFwiJTBBICAgICAgICAgICsgdHlwZSA9IFwiU1wiJTBBICAgICAgICB9JTBBJTBBICAgICAgKyBwb2ludF9pbl90aW1lX3JlY292ZXJ5IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgdHRsIChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgfSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgxMiB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0ucmFuZG9tX3BldC5zdWZmaXggd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwicmFuZG9tX3BldFwiIFwic3VmZml4XCIgeyUwQSAgICAgICsgaWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbGVuZ3RoICAgID0gMiUwQSAgICAgICsgcHJlZml4ICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgKyBzZXBhcmF0b3IgPSBcIi1cIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZHluYW1vZGJfdGFibGVcIiBcInRlcnJhZm9ybV9sb2Nrc1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIiUwQSAgICAgICsgaGFzaF9rZXkgICAgICAgICA9IFwiTG9ja0lEXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVhZF9jYXBhY2l0eSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX3ZpZXdfdHlwZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIiUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0aGUgbWFpbiBBV1MgYWNjb3VudCA5OTA0NjY3NDgwNDUgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2xcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiJTBBICAgICAgICAgICsgXCJzdGF0ZV9idWNrZXRcIiAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieV9tb2R1bGVcIiA9IFwiaW5mcmFob3VzZS9zdGF0ZS1idWNrZXQvYXdzXCIlMEEgICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgICAgICAgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2xcIiUwQSAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgICAgfSUwQSAgICAgICsgd3JpdGVfY2FwYWNpdHkgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIGF0dHJpYnV0ZSB7JTBBICAgICAgICAgICsgbmFtZSA9IFwiTG9ja0lEXCIlMEEgICAgICAgICAgKyB0eXBlID0gXCJTXCIlMEEgICAgICAgIH0lMEElMEEgICAgICArIHBvaW50X2luX3RpbWVfcmVjb3ZlcnkgKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc2VydmVyX3NpZGVfZW5jcnlwdGlvbiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyB0dGwgKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRoZSBtYWluIEFXUyBhY2NvdW50IDk5MDQ2Njc0ODA0NSBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbFwiJTBBICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0aGUgbWFpbiBBV1MgYWNjb3VudCA5OTA0NjY3NDgwNDUgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2xcIiUwQSAgICAgICAgICAtIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiJTBBICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDEyIHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5yYW5kb21fcGV0LnN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7JTBBICAgICAgKyBpZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsZW5ndGggICAgPSAyJTBBICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCIlMEEgICAgICArIHNlcGFyYXRvciA9IFwiLVwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZHluYW1vZGJfdGFibGVcIiBcInRlcnJhZm9ybV9sb2Nrc1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBiaWxsaW5nX21vZGUgICAgID0gXCJQQVlfUEVSX1JFUVVFU1RcIiUwQSAgICAgICsgaGFzaF9rZXkgICAgICAgICA9IFwiTG9ja0lEXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVhZF9jYXBhY2l0eSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0cmVhbV9hcm4gICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdHJlYW1fbGFiZWwgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RyZWFtX3ZpZXdfdHlwZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIiUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5X21vZHVsZVwiID0gXCJpbmZyYWhvdXNlL3N0YXRlLWJ1Y2tldC9hd3NcIiUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiAgICAgICA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwic3RhdGVfYnVja2V0XCIgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgIH0lMEEgICAgICArIHdyaXRlX2NhcGFjaXR5ICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBhdHRyaWJ1dGUgeyUwQSAgICAgICAgICArIG5hbWUgPSBcIkxvY2tJRFwiJTBBICAgICAgICAgICsgdHlwZSA9IFwiU1wiJTBBICAgICAgICB9JTBBJTBBICAgICAgKyBwb2ludF9pbl90aW1lX3JlY292ZXJ5IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgdHRsIChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIC0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgIC0gXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICB9IC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgLSBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgLSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgICAgLSBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgIH0gLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgIyAoMTIgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5yYW5kb21fcGV0LnN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJyYW5kb21fcGV0XCIgXCJzdWZmaXhcIiB7JTBBICAgICAgKyBpZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsZW5ndGggICAgPSAyJTBBICAgICAgKyBwcmVmaXggICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgKyBzZXBhcmF0b3IgPSBcIi1cIiUwQSAgICB9JTBBJTBBUGxhbjogMTAgdG8gYWRkLCA1IHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAxMCwgImNoYW5nZSI6IDUsICJkZXN0cm95IjogMH19```
</p></details>